#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/monadial/monadial-infrastructure/runs/run-tJEixZ6J6ZkneBwR

Waiting for the plan to start...

Terraform v0.15.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.0.4"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # helm_release.ingress_gateway will be created
  + resource "helm_release" "ingress_gateway" {
      + atomic                     = false
      + chart                      = "traefik"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "traefik"
      + namespace                  = "traefik"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.traefik.io/traefik"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ingressRoute:
                  dashboard:
                    enabled: true
                    annotations: { traefik.ingress.kubernetes.io/router.tls: "true" }
                
                ports:
                  web:
                    redirectTo: websecure
                
                additionalArguments:
                  - "--log.level=INFO"
                  - "--entrypoints.websecure.http.tls"
                  - "--providers.kubernetesIngress.ingressClass=traefik-cert-manager"
                  - "--ping"
                  - "--metrics.prometheus"
            EOT,
        ]
      + verify                     = false
      + version                    = "9.19.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.cert_manager_namespace will be created
  + resource "kubernetes_namespace" "cert_manager_namespace" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "cert-manager"
            }
          + generation       = (known after apply)
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.ingress_gateway_namespace will be created
  + resource "kubernetes_namespace" "ingress_gateway_namespace" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "traefik"
            }
          + generation       = (known after apply)
          + name             = "traefik"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # null_resource.kubeconfig will be created
  + resource "null_resource" "kubeconfig" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # scaleway_k8s_cluster.mcluster will be created
  + resource "scaleway_k8s_cluster" "mcluster" {
      + apiserver_url               = (known after apply)
      + cni                         = "cilium"
      + created_at                  = (known after apply)
      + delete_additional_resources = false
      + description                 = "Monadial K8s cluster."
      + id                          = (known after apply)
      + kubeconfig                  = (known after apply)
      + name                        = "monadial-k8s-cluster"
      + organization_id             = (known after apply)
      + project_id                  = (known after apply)
      + region                      = (known after apply)
      + status                      = (known after apply)
      + updated_at                  = (known after apply)
      + upgrade_available           = (known after apply)
      + version                     = "1.21.0"
      + wildcard_dns                = (known after apply)

      + auto_upgrade {
          + enable                        = (known after apply)
          + maintenance_window_day        = (known after apply)
          + maintenance_window_start_hour = (known after apply)
        }

      + autoscaler_config {
          + balance_similar_node_groups      = true
          + disable_scale_down               = false
          + estimator                        = "binpacking"
          + expander                         = "random"
          + expendable_pods_priority_cutoff  = -5
          + ignore_daemonsets_utilization    = true
          + max_graceful_termination_sec     = 600
          + scale_down_delay_after_add       = "5m"
          + scale_down_unneeded_time         = "10m"
          + scale_down_utilization_threshold = 0.5
        }

      + open_id_connect_config {
          + client_id       = (known after apply)
          + groups_claim    = (known after apply)
          + groups_prefix   = (known after apply)
          + issuer_url      = (known after apply)
          + required_claim  = (known after apply)
          + username_claim  = (known after apply)
          + username_prefix = (known after apply)
        }
    }

  # scaleway_k8s_pool.mpool will be created
  + resource "scaleway_k8s_pool" "mpool" {
      + autohealing         = true
      + autoscaling         = true
      + cluster_id          = (known after apply)
      + container_runtime   = "docker"
      + created_at          = (known after apply)
      + current_size        = (known after apply)
      + id                  = (known after apply)
      + max_size            = 6
      + min_size            = 2
      + name                = "monadial-k8s-pool"
      + node_type           = "DEV1-M"
      + nodes               = (known after apply)
      + region              = (known after apply)
      + size                = 2
      + status              = (known after apply)
      + updated_at          = (known after apply)
      + version             = (known after apply)
      + wait_for_pool_ready = false
      + zone                = (known after apply)

      + upgrade_policy {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @tmihalicka, Action: `pull_request`, Working Directory: ``, Workflow: `Monadial Terraform IAC`*